espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/axi_dma_eco5_struct.h
/** Type of tx_crc_data_en_addr_chn register
 *  This register is used to config addr of crc data_8bit en
 */
typedef union {
    struct {
        /** tx_crc_data_en_addr_chn : R/W; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t tx_crc_data_en_addr_chn:32;
    };
    uint32_t val;
} axi_dma_tx_crc_data_en_addr_chn_reg_t;

/** Type of out_conf0_ch1 register
 *  Configure 0 register of Tx channel1
 */
typedef union {
    struct {
        /** out_rst_ch1 : R/W; bitpos: [0]; default: 0;
         *  This bit is used to reset AXI_DMA channel1 Tx FSM and Tx FIFO pointer.
         */
        uint32_t out_rst_ch1:1;
        /** out_loop_test_ch1 : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t out_loop_test_ch1:1;
        /** out_auto_wrback_ch1 : R/W; bitpos: [2]; default: 0;
         *  Set this bit to enable automatic outlink-writeback when all the data in tx buffer
         *  has been transmitted.
         */
        uint32_t out_auto_wrback_ch1:1;
        /** out_eof_mode_ch1 : R/W; bitpos: [3]; default: 1;
         *  EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel1 is
         *  generated when data need to transmit has been popped from FIFO in AXI_DMA
         */
        uint32_t out_eof_mode_ch1:1;
        /** out_etm_en_ch1 : R/W; bitpos: [4]; default: 0;
         *  Set this bit to 1 to enable etm control mode, dma Tx channel1 is triggered by etm
         *  task.
         */
        uint32_t out_etm_en_ch1:1;
        /** out_burst_size_sel_ch1 : R/W; bitpos: [7:5]; default: 0;
         *  3'b000-3'b100:burst length 8byte~128byte
         */
        uint32_t out_burst_size_sel_ch1:3;
        /** out_cmd_disable_ch1 : R/W; bitpos: [8]; default: 0;
         *  1:mean disable cmd of this ch1
         */
        uint32_t out_cmd_disable_ch1:1;
        /** out_ecc_aec_en_ch1 : R/W; bitpos: [9]; default: 0;
         *  1: mean access ecc or aes domain,0: mean not
         */
        uint32_t out_ecc_aec_en_ch1:1;
        /** outdscr_burst_en_ch1 : R/W; bitpos: [10]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Tx channel1 reading link
         *  descriptor when accessing internal SRAM.
         */
        uint32_t outdscr_burst_en_ch1:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} axi_dma_out_conf0_ch1_reg_t;

/** Type of out_conf0_ch2 register
 *  Configure 0 register of Tx channel2
 */
typedef union {
    struct {
        /** out_rst_ch2 : R/W; bitpos: [0]; default: 0;
         *  This bit is used to reset AXI_DMA channel2 Tx FSM and Tx FIFO pointer.
         */
        uint32_t out_rst_ch2:1;
        /** out_loop_test_ch2 : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t out_loop_test_ch2:1;
        /** out_auto_wrback_ch2 : R/W; bitpos: [2]; default: 0;
         *  Set this bit to enable automatic outlink-writeback when all the data in tx buffer
         *  has been transmitted.
         */
        uint32_t out_auto_wrback_ch2:1;
        /** out_eof_mode_ch2 : R/W; bitpos: [3]; default: 1;
         *  EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel2 is
         *  generated when data need to transmit has been popped from FIFO in AXI_DMA
         */
        uint32_t out_eof_mode_ch2:1;
        /** out_etm_en_ch2 : R/W; bitpos: [4]; default: 0;
         *  Set this bit to 1 to enable etm control mode, dma Tx channel2 is triggered by etm
         *  task.
         */
        uint32_t out_etm_en_ch2:1;
        /** out_burst_size_sel_ch2 : R/W; bitpos: [7:5]; default: 0;
         *  3'b000-3'b100:burst length 8byte~128byte
         */
        uint32_t out_burst_size_sel_ch2:3;
        /** out_cmd_disable_ch2 : R/W; bitpos: [8]; default: 0;
         *  1:mean disable cmd of this ch2
         */
        uint32_t out_cmd_disable_ch2:1;
        /** out_ecc_aec_en_ch2 : R/W; bitpos: [9]; default: 0;
         *  1: mean access ecc or aes domain,0: mean not
         */
        uint32_t out_ecc_aec_en_ch2:1;
        /** outdscr_burst_en_ch2 : R/W; bitpos: [10]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Tx channel2 reading link
         *  descriptor when accessing internal SRAM.
         */
        uint32_t outdscr_burst_en_ch2:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} axi_dma_out_conf0_ch2_reg_t;

/** Type of arb_timeout register
 *  This retister is used to config arbiter time slice
 */
typedef union {
    struct {
        /** arb_timeout_tx : R/W; bitpos: [15:0]; default: 0;
         *  This register is used to config tx arbiter time out value
         */
        uint32_t arb_timeout_tx:16;
        /** arb_timeout_rx : R/W; bitpos: [31:16]; default: 0;
         *  This register is used to config rx arbiter time out value
         */
        uint32_t arb_timeout_rx:16;
    };
    uint32_t val;
} axi_dma_arb_timeout_reg_t;

/** Type of weight_en register
 *  This register is used to config arbiter weight function to on or off
 */
typedef union {
    struct {
        /** weight_en_tx : R/W; bitpos: [0]; default: 0;
         *  This register is used to config tx arbiter weight function  off/on
         */
        uint32_t weight_en_tx:1;
        /** weight_en_rx : R/W; bitpos: [1]; default: 0;
         *  This register is used to config rx arbiter weight function  off/on
         */
        uint32_t weight_en_rx:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} axi_dma_weight_en_reg_t;

/** Type of in_mem_conf register
 *  Mem power configure register of Rx channel
 */
typedef union {
    struct {
        /** in_mem_clk_force_en : R/W; bitpos: [0]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in
         *  AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.
         */
        uint32_t in_mem_clk_force_en:1;
        /** in_mem_force_pu : R/W; bitpos: [1]; default: 0;
         *  Force power up ram
         */
        uint32_t in_mem_force_pu:1;
        /** in_mem_force_pd : R/W; bitpos: [2]; default: 0;
         *  Force power down ram
         */
        uint32_t in_mem_force_pd:1;
        /** out_mem_clk_force_en : R/W; bitpos: [3]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in
         *  AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.
         */
        uint32_t out_mem_clk_force_en:1;
        /** out_mem_force_pu : R/W; bitpos: [4]; default: 0;
         *  Force power up ram
         */
        uint32_t out_mem_force_pu:1;
        /** out_mem_force_pd : R/W; bitpos: [5]; default: 0;
         *  Force power down ram
         */
        uint32_t out_mem_force_pd:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} axi_dma_in_mem_conf_reg_t;

