espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/axi_dma_eco5_struct.h
/** Type of intr_mem_start_addr register
 *  The start address of accessible address space.
 */
typedef union {
    struct {
        /** access_intr_mem_start_addr : R/W; bitpos: [31:0]; default: 806354944;
         *  The start address of accessible address space.
         */
        uint32_t access_intr_mem_start_addr:32;
    };
    uint32_t val;
} axi_dma_intr_mem_start_addr_reg_t;

/** Type of intr_mem_end_addr register
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
typedef union {
    struct {
        /** access_intr_mem_end_addr : R/W; bitpos: [31:0]; default: 2415919103;
         *  The end address of accessible address space. The access address beyond this range
         *  would lead to descriptor error.
         */
        uint32_t access_intr_mem_end_addr:32;
    };
    uint32_t val;
} axi_dma_intr_mem_end_addr_reg_t;

/** Type of extr_mem_start_addr register
 *  The start address of accessible address space.
 */
typedef union {
    struct {
        /** access_extr_mem_start_addr : R/W; bitpos: [31:0]; default: 806354944;
         *  The start address of accessible address space.
         */
        uint32_t access_extr_mem_start_addr:32;
    };
    uint32_t val;
} axi_dma_extr_mem_start_addr_reg_t;

/** Type of extr_mem_end_addr register
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
typedef union {
    struct {
        /** access_extr_mem_end_addr : R/W; bitpos: [31:0]; default: 2415919103;
         *  The end address of accessible address space. The access address beyond this range
         *  would lead to descriptor error.
         */
        uint32_t access_extr_mem_end_addr:32;
    };
    uint32_t val;
} axi_dma_extr_mem_end_addr_reg_t;

/** Type of in_reset_avail_chn register
 *  The rx channel n reset valid_flag register.
 */
typedef union {
    struct {
        /** in_reset_avail_chn : RO; bitpos: [0]; default: 1;
         *  rx chan0 reset valid reg.
         */
        uint32_t in_reset_avail_chn:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} axi_dma_in_reset_avail_chn_reg_t;

/** Type of out_reset_avail_chn register
 *  The tx channel n reset valid_flag register.
 */
typedef union {
    struct {
        /** out_reset_avail_chn : RO; bitpos: [0]; default: 1;
         *  tx chan0 reset valid reg.
         */
        uint32_t out_reset_avail_chn:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} axi_dma_out_reset_avail_chn_reg_t;

/** Type of misc_conf register
 *  MISC register
 */
typedef union {
    struct {
        /** axim_rst_wr_inter : R/W; bitpos: [0]; default: 0;
         *  Set this bit then clear this bit to reset the internal axi_wr FSM.
         */
        uint32_t axim_rst_wr_inter:1;
        /** axim_rst_rd_inter : R/W; bitpos: [1]; default: 0;
         *  Set this bit then clear this bit to reset the internal axi_rd FSM.
         */
        uint32_t axim_rst_rd_inter:1;
        uint32_t reserved_2:1;
        /** arb_pri_dis : R/W; bitpos: [3]; default: 0;
         *  Set this bit to disable priority arbitration function.
         */
        uint32_t arb_pri_dis:1;
        /** clk_en : R/W; bitpos: [4]; default: 0;
         *  1'h1: Force clock on for register. 1'h0: Support clock only when application writes
         *  registers.
         */
        uint32_t clk_en:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} axi_dma_misc_conf_reg_t;


/** Group: Status Registers */
/** Type of infifo_status_chn register
 *  Receive FIFO status of Rx channel n
 */
typedef union {
    struct {
        /** infifo_l3_full_chn : RO; bitpos: [0]; default: 1;
         *  L3 Rx FIFO full signal for Rx channel 0.
         */
        uint32_t infifo_l3_full_chn:1;
        /** infifo_l3_empty_chn : RO; bitpos: [1]; default: 1;
         *  L3 Rx FIFO empty signal for Rx channel 0.
         */
        uint32_t infifo_l3_empty_chn:1;
        /** infifo_l3_cnt_chn : RO; bitpos: [7:2]; default: 0;
         *  The register stores the byte number of the data in L3 Rx FIFO for Rx channel 0.
         */
        uint32_t infifo_l3_cnt_chn:6;
        /** infifo_l3_udf_chn : RO; bitpos: [8]; default: 0;
         *  L3 Rx FIFO under flow signal for Rx channel 0.
         */
        uint32_t infifo_l3_udf_chn:1;
        /** infifo_l3_ovf_chn : RO; bitpos: [9]; default: 0;
         *  L3 Rx FIFO over flow signal for Rx channel 0.
         */
        uint32_t infifo_l3_ovf_chn:1;
        /** infifo_l1_full_chn : RO; bitpos: [10]; default: 0;
         *  L1 Rx FIFO full signal for Rx channel 0.
         */
        uint32_t infifo_l1_full_chn:1;
        /** infifo_l1_empty_chn : RO; bitpos: [11]; default: 1;
         *  L1 Rx FIFO empty signal for Rx channel 0.
         */
        uint32_t infifo_l1_empty_chn:1;
        /** infifo_l1_udf_chn : RO; bitpos: [12]; default: 0;
         *  L1 Rx FIFO under flow signal for Rx channel 0.
         */
        uint32_t infifo_l1_udf_chn:1;
        /** infifo_l1_ovf_chn : RO; bitpos: [13]; default: 0;
         *  L1 Rx FIFO over flow signal for Rx channel 0.
         */
        uint32_t infifo_l1_ovf_chn:1;
        /** infifo_l2_full_chn : RO; bitpos: [14]; default: 0;
         *  L2 Rx RAM full signal for Rx channel 0.
         */
        uint32_t infifo_l2_full_chn:1;
        /** infifo_l2_empty_chn : RO; bitpos: [15]; default: 1;
         *  L2 Rx RAM empty signal for Rx channel 0.
         */
        uint32_t infifo_l2_empty_chn:1;
        /** infifo_l2_udf_chn : RO; bitpos: [16]; default: 0;
         *  L2 Rx FIFO under flow signal for Rx channel 0.
         */
        uint32_t infifo_l2_udf_chn:1;
        /** infifo_l2_ovf_chn : RO; bitpos: [17]; default: 0;
         *  L2 Rx FIFO over flow signal for Rx channel 0.
         */
        uint32_t infifo_l2_ovf_chn:1;
        uint32_t reserved_18:5;
        /** in_remain_under_1b_chn : RO; bitpos: [23]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_1b_chn:1;
        /** in_remain_under_2b_chn : RO; bitpos: [24]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_2b_chn:1;
        /** in_remain_under_3b_chn : RO; bitpos: [25]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_3b_chn:1;
        /** in_remain_under_4b_chn : RO; bitpos: [26]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_4b_chn:1;
        /** in_remain_under_5b_chn : RO; bitpos: [27]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_5b_chn:1;
        /** in_remain_under_6b_chn : RO; bitpos: [28]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_6b_chn:1;
        /** in_remain_under_7b_chn : RO; bitpos: [29]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_7b_chn:1;
        /** in_remain_under_8b_chn : RO; bitpos: [30]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_8b_chn:1;
        /** in_buf_hungry_chn : RO; bitpos: [31]; default: 0;
         *  reserved
         */
        uint32_t in_buf_hungry_chn:1;
    };
    uint32_t val;
} axi_dma_infifo_status_chn_reg_t;

