espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/axi_dma_eco5_struct.h
/** Type of in_state_chn register
 *  Receive status of Rx channel n
 */
typedef union {
    struct {
        /** inlink_dscr_addr_chn : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current inlink descriptor's address.
         */
        uint32_t inlink_dscr_addr_chn:18;
        /** in_dscr_state_chn : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t in_dscr_state_chn:2;
        /** in_state_chn : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t in_state_chn:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} axi_dma_in_state_chn_reg_t;

/** Type of in_suc_eof_des_addr_chn register
 *  Inlink descriptor address when EOF occurs of Rx channel n
 */
typedef union {
    struct {
        /** in_suc_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t in_suc_eof_des_addr_chn:32;
    };
    uint32_t val;
} axi_dma_in_suc_eof_des_addr_chn_reg_t;

/** Type of in_err_eof_des_addr_chn register
 *  Inlink descriptor address when errors occur of Rx channel n
 */
typedef union {
    struct {
        /** in_err_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when there are some
         *  errors in current receiving data. Only used when peripheral is UHCI0.
         */
        uint32_t in_err_eof_des_addr_chn:32;
    };
    uint32_t val;
} axi_dma_in_err_eof_des_addr_chn_reg_t;

/** Type of in_dscr_chn register
 *  Current inlink descriptor address of Rx channel n
 */
typedef union {
    struct {
        /** inlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the current inlink descriptor x.
         */
        uint32_t inlink_dscr_chn:32;
    };
    uint32_t val;
} axi_dma_in_dscr_chn_reg_t;

/** Type of in_dscr_bf0_chn register
 *  The last inlink descriptor address of Rx channel n
 */
typedef union {
    struct {
        /** inlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the last inlink descriptor x-1.
         */
        uint32_t inlink_dscr_bf0_chn:32;
    };
    uint32_t val;
} axi_dma_in_dscr_bf0_chn_reg_t;

/** Type of in_dscr_bf1_chn register
 *  The second-to-last inlink descriptor address of Rx channel n
 */
typedef union {
    struct {
        /** inlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last inlink descriptor x-2.
         */
        uint32_t inlink_dscr_bf1_chn:32;
    };
    uint32_t val;
} axi_dma_in_dscr_bf1_chn_reg_t;

/** Type of outfifo_status_chn register
 *  Transmit FIFO status of Tx channeln
 */
typedef union {
    struct {
        /** outfifo_l3_full_chn : RO; bitpos: [0]; default: 0;
         *  L3 Tx FIFO full signal for Tx channel0.
         */
        uint32_t outfifo_l3_full_chn:1;
        /** outfifo_l3_empty_chn : RO; bitpos: [1]; default: 1;
         *  L3 Tx FIFO empty signal for Tx channel0.
         */
        uint32_t outfifo_l3_empty_chn:1;
        /** outfifo_l3_cnt_chn : RO; bitpos: [7:2]; default: 0;
         *  The register stores the byte number of the data in L3 Tx FIFO for Tx channel0.
         */
        uint32_t outfifo_l3_cnt_chn:6;
        /** outfifo_l3_udf_chn : RO; bitpos: [8]; default: 0;
         *  L3 Tx FIFO under flow signal for Tx channel0.
         */
        uint32_t outfifo_l3_udf_chn:1;
        /** outfifo_l3_ovf_chn : RO; bitpos: [9]; default: 0;
         *  L3 Tx FIFO over flow signal for Tx channel0.
         */
        uint32_t outfifo_l3_ovf_chn:1;
        /** outfifo_l1_full_chn : RO; bitpos: [10]; default: 0;
         *  L1 Tx FIFO full signal for Tx channel0.
         */
        uint32_t outfifo_l1_full_chn:1;
        /** outfifo_l1_empty_chn : RO; bitpos: [11]; default: 1;
         *  L1 Tx FIFO empty signal for Tx channel0.
         */
        uint32_t outfifo_l1_empty_chn:1;
        /** outfifo_l1_udf_chn : RO; bitpos: [12]; default: 0;
         *  L1 Tx FIFO under flow signal for Tx channel0.
         */
        uint32_t outfifo_l1_udf_chn:1;
        /** outfifo_l1_ovf_chn : RO; bitpos: [13]; default: 0;
         *  L1 Tx FIFO over flow signal for Tx channel0.
         */
        uint32_t outfifo_l1_ovf_chn:1;
        /** outfifo_l2_full_chn : RO; bitpos: [14]; default: 0;
         *  L2 Tx RAM full signal for Tx channel0.
         */
        uint32_t outfifo_l2_full_chn:1;
        /** outfifo_l2_empty_chn : RO; bitpos: [15]; default: 1;
         *  L2 Tx RAM empty signal for Tx channel0.
         */
        uint32_t outfifo_l2_empty_chn:1;
        /** outfifo_l2_udf_chn : RO; bitpos: [16]; default: 0;
         *  L2 Tx FIFO under flow signal for Tx channel0.
         */
        uint32_t outfifo_l2_udf_chn:1;
        /** outfifo_l2_ovf_chn : RO; bitpos: [17]; default: 0;
         *  L2 Tx FIFO over flow signal for Tx channel0.
         */
        uint32_t outfifo_l2_ovf_chn:1;
        uint32_t reserved_18:5;
        /** out_remain_under_1b_chn : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_1b_chn:1;
        /** out_remain_under_2b_chn : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_2b_chn:1;
        /** out_remain_under_3b_chn : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_3b_chn:1;
        /** out_remain_under_4b_chn : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_4b_chn:1;
        /** out_remain_under_5b_chn : RO; bitpos: [27]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_5b_chn:1;
        /** out_remain_under_6b_chn : RO; bitpos: [28]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_6b_chn:1;
        /** out_remain_under_7b_chn : RO; bitpos: [29]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_7b_chn:1;
        /** out_remain_under_8b_chn : RO; bitpos: [30]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_8b_chn:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} axi_dma_outfifo_status_chn_reg_t;

/** Type of out_state_chn register
 *  Transmit status of Tx channeln
 */
typedef union {
    struct {
        /** outlink_dscr_addr_chn : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current outlink descriptor's address.
         */
        uint32_t outlink_dscr_addr_chn:18;
        /** out_dscr_state_chn : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t out_dscr_state_chn:2;
        /** out_state_chn : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t out_state_chn:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} axi_dma_out_state_chn_reg_t;

/** Type of out_eof_des_addr_chn register
 *  Outlink descriptor address when EOF occurs of Tx channeln
 */
typedef union {
    struct {
        /** out_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr_chn:32;
    };
    uint32_t val;
} axi_dma_out_eof_des_addr_chn_reg_t;

/** Type of out_eof_bfr_des_addr_chn register
 *  The last outlink descriptor address when EOF occurs of Tx channeln
 */
typedef union {
    struct {
        /** out_eof_bfr_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor before the last outlink
         *  descriptor.
         */
        uint32_t out_eof_bfr_des_addr_chn:32;
    };
    uint32_t val;
} axi_dma_out_eof_bfr_des_addr_chn_reg_t;

