espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/axi_dma_eco5_struct.h
/** Group: Configuration Registers */
/** Type of rx_crc_en_wr_data_chn register
 *  This resister is used to config chn crc en for every bit
 */
typedef union {
    struct {
        /** rx_crc_en_wr_data_chn : R/W; bitpos: [31:0]; default: 0;
         *  This register is used to enable rx ch0 crc 32bit on/off
         */
        uint32_t rx_crc_en_wr_data_chn:32;
    };
    uint32_t val;
} axi_dma_rx_crc_en_wr_data_chn_reg_t;


/** Group: Debug Registers */
/** Type of rdn_result register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_ena : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t rdn_ena:1;
        /** rdn_result : RO; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t rdn_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} axi_dma_rdn_result_reg_t;

/** Type of rdn_eco_high register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  The start address of accessible address space.
         */
        uint32_t rdn_eco_high:32;
    };
    uint32_t val;
} axi_dma_rdn_eco_high_reg_t;

/** Type of rdn_eco_low register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  The start address of accessible address space.
         */
        uint32_t rdn_eco_low:32;
    };
    uint32_t val;
} axi_dma_rdn_eco_low_reg_t;


/** Group: Version Registers */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 36712768;
         *  register version.
         */
        uint32_t date:32;
    };
    uint32_t val;
} axi_dma_date_reg_t;


typedef struct {
    volatile axi_dma_in_int_raw_chn_reg_t in_int_raw_ch0;
    volatile axi_dma_in_int_st_chn_reg_t in_int_st_ch0;
    volatile axi_dma_in_int_ena_chn_reg_t in_int_ena_ch0;
    volatile axi_dma_in_int_clr_chn_reg_t in_int_clr_ch0;
    volatile axi_dma_in_conf0_chn_reg_t in_conf0_ch0;
    volatile axi_dma_in_conf1_chn_reg_t in_conf1_ch0;
    volatile axi_dma_infifo_status_chn_reg_t infifo_status_ch0;
    volatile axi_dma_in_pop_chn_reg_t in_pop_ch0;
    volatile axi_dma_in_link1_chn_reg_t in_link1_ch0;
    volatile axi_dma_in_link2_chn_reg_t in_link2_ch0;
    volatile axi_dma_in_state_chn_reg_t in_state_ch0;
    volatile axi_dma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch0;
    volatile axi_dma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch0;
    volatile axi_dma_in_dscr_chn_reg_t in_dscr_ch0;
    volatile axi_dma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch0;
    volatile axi_dma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch0;
    volatile axi_dma_in_pri_chn_reg_t in_pri_ch0;
    volatile axi_dma_in_peri_sel_chn_reg_t in_peri_sel_ch0;
    volatile axi_dma_in_crc_init_data_chn_reg_t in_crc_init_data_ch0;
    volatile axi_dma_rx_crc_width_chn_reg_t rx_crc_width_ch0;
    volatile axi_dma_in_crc_clear_chn_reg_t in_crc_clear_ch0;
    volatile axi_dma_in_crc_final_result_chn_reg_t in_crc_final_result_ch0;
    volatile axi_dma_rx_crc_en_wr_data_chn_reg_t rx_crc_en_wr_data_ch0;
    volatile axi_dma_rx_crc_en_addr_chn_reg_t rx_crc_en_addr_ch0;
    volatile axi_dma_rx_crc_data_en_wr_data_chn_reg_t rx_crc_data_en_wr_data_ch0;
    volatile axi_dma_rx_crc_data_en_addr_chn_reg_t rx_crc_data_en_addr_ch0;
    volatile axi_dma_in_int_raw_chn_reg_t in_int_raw_ch1;
    volatile axi_dma_in_int_st_chn_reg_t in_int_st_ch1;
    volatile axi_dma_in_int_ena_chn_reg_t in_int_ena_ch1;
    volatile axi_dma_in_int_clr_chn_reg_t in_int_clr_ch1;
    volatile axi_dma_in_conf0_chn_reg_t in_conf0_ch1;
    volatile axi_dma_in_conf1_chn_reg_t in_conf1_ch1;
    volatile axi_dma_infifo_status_chn_reg_t infifo_status_ch1;
    volatile axi_dma_in_pop_chn_reg_t in_pop_ch1;
    volatile axi_dma_in_link1_chn_reg_t in_link1_ch1;
    volatile axi_dma_in_link2_chn_reg_t in_link2_ch1;
    volatile axi_dma_in_state_chn_reg_t in_state_ch1;
    volatile axi_dma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch1;
    volatile axi_dma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch1;
    volatile axi_dma_in_dscr_chn_reg_t in_dscr_ch1;
    volatile axi_dma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch1;
    volatile axi_dma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch1;
    volatile axi_dma_in_pri_chn_reg_t in_pri_ch1;
    volatile axi_dma_in_peri_sel_chn_reg_t in_peri_sel_ch1;
    volatile axi_dma_in_crc_init_data_chn_reg_t in_crc_init_data_ch1;
    volatile axi_dma_rx_crc_width_chn_reg_t rx_crc_width_ch1;
    volatile axi_dma_in_crc_clear_chn_reg_t in_crc_clear_ch1;
    volatile axi_dma_in_crc_final_result_chn_reg_t in_crc_final_result_ch1;
    volatile axi_dma_rx_crc_en_wr_data_chn_reg_t rx_crc_en_wr_data_ch1;
    volatile axi_dma_rx_crc_en_addr_chn_reg_t rx_crc_en_addr_ch1;
    volatile axi_dma_rx_crc_data_en_wr_data_chn_reg_t rx_crc_data_en_wr_data_ch1;
    volatile axi_dma_rx_crc_data_en_addr_chn_reg_t rx_crc_data_en_addr_ch1;
    volatile axi_dma_in_int_raw_chn_reg_t in_int_raw_ch2;
    volatile axi_dma_in_int_st_chn_reg_t in_int_st_ch2;
    volatile axi_dma_in_int_ena_chn_reg_t in_int_ena_ch2;
    volatile axi_dma_in_int_clr_chn_reg_t in_int_clr_ch2;
    volatile axi_dma_in_conf0_chn_reg_t in_conf0_ch2;
    volatile axi_dma_in_conf1_chn_reg_t in_conf1_ch2;
    volatile axi_dma_infifo_status_chn_reg_t infifo_status_ch2;
    volatile axi_dma_in_pop_chn_reg_t in_pop_ch2;
    volatile axi_dma_in_link1_chn_reg_t in_link1_ch2;
    volatile axi_dma_in_link2_chn_reg_t in_link2_ch2;
    volatile axi_dma_in_state_chn_reg_t in_state_ch2;
    volatile axi_dma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch2;
    volatile axi_dma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch2;
    volatile axi_dma_in_dscr_chn_reg_t in_dscr_ch2;
    volatile axi_dma_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch2;
    volatile axi_dma_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch2;
    volatile axi_dma_in_pri_chn_reg_t in_pri_ch2;
    volatile axi_dma_in_peri_sel_chn_reg_t in_peri_sel_ch2;
    volatile axi_dma_in_crc_init_data_chn_reg_t in_crc_init_data_ch2;
    volatile axi_dma_rx_crc_width_chn_reg_t rx_crc_width_ch2;
    volatile axi_dma_in_crc_clear_chn_reg_t in_crc_clear_ch2;
    volatile axi_dma_in_crc_final_result_chn_reg_t in_crc_final_result_ch2;
    volatile axi_dma_rx_crc_en_wr_data_chn_reg_t rx_crc_en_wr_data_ch2;
    volatile axi_dma_rx_crc_en_addr_chn_reg_t rx_crc_en_addr_ch2;
    volatile axi_dma_rx_crc_data_en_wr_data_chn_reg_t rx_crc_data_en_wr_data_ch2;
    volatile axi_dma_rx_crc_data_en_addr_chn_reg_t rx_crc_data_en_addr_ch2;
    volatile axi_dma_out_int_raw_chn_reg_t out_int_raw_ch0;
    volatile axi_dma_out_int_st_chn_reg_t out_int_st_ch0;
    volatile axi_dma_out_int_ena_chn_reg_t out_int_ena_ch0;
    volatile axi_dma_out_int_clr_chn_reg_t out_int_clr_ch0;
    volatile axi_dma_out_conf0_ch0_reg_t out_conf0_ch0;
    volatile axi_dma_out_conf1_chn_reg_t out_conf1_ch0;
    volatile axi_dma_outfifo_status_chn_reg_t outfifo_status_ch0;
    volatile axi_dma_out_push_chn_reg_t out_push_ch0;
    volatile axi_dma_out_link1_chn_reg_t out_link1_ch0;
    volatile axi_dma_out_link2_chn_reg_t out_link2_ch0;
    volatile axi_dma_out_state_chn_reg_t out_state_ch0;
    volatile axi_dma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch0;
    volatile axi_dma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch0;
    volatile axi_dma_out_dscr_chn_reg_t out_dscr_ch0;
    volatile axi_dma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch0;
    volatile axi_dma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch0;
    volatile axi_dma_out_pri_chn_reg_t out_pri_ch0;
    volatile axi_dma_out_peri_sel_chn_reg_t out_peri_sel_ch0;
    volatile axi_dma_out_crc_init_data_chn_reg_t out_crc_init_data_ch0;
    volatile axi_dma_tx_crc_width_chn_reg_t tx_crc_width_ch0;
    volatile axi_dma_out_crc_clear_chn_reg_t out_crc_clear_ch0;
    volatile axi_dma_out_crc_final_result_chn_reg_t out_crc_final_result_ch0;
    volatile axi_dma_tx_crc_en_wr_data_chn_reg_t tx_crc_en_wr_data_ch0;
    volatile axi_dma_tx_crc_en_addr_chn_reg_t tx_crc_en_addr_ch0;
    volatile axi_dma_tx_crc_data_en_wr_data_chn_reg_t tx_crc_data_en_wr_data_ch0;
    volatile axi_dma_tx_crc_data_en_addr_chn_reg_t tx_crc_data_en_addr_ch0;
    volatile axi_dma_out_int_raw_chn_reg_t out_int_raw_ch1;
    volatile axi_dma_out_int_st_chn_reg_t out_int_st_ch1;
    volatile axi_dma_out_int_ena_chn_reg_t out_int_ena_ch1;
    volatile axi_dma_out_int_clr_chn_reg_t out_int_clr_ch1;
    volatile axi_dma_out_conf0_ch1_reg_t out_conf0_ch1;
    volatile axi_dma_out_conf1_chn_reg_t out_conf1_ch1;
    volatile axi_dma_outfifo_status_chn_reg_t outfifo_status_ch1;
    volatile axi_dma_out_push_chn_reg_t out_push_ch1;
    volatile axi_dma_out_link1_chn_reg_t out_link1_ch1;
    volatile axi_dma_out_link2_chn_reg_t out_link2_ch1;
    volatile axi_dma_out_state_chn_reg_t out_state_ch1;
    volatile axi_dma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch1;
    volatile axi_dma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch1;
    volatile axi_dma_out_dscr_chn_reg_t out_dscr_ch1;
    volatile axi_dma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch1;
    volatile axi_dma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch1;
    volatile axi_dma_out_pri_chn_reg_t out_pri_ch1;
    volatile axi_dma_out_peri_sel_chn_reg_t out_peri_sel_ch1;
    volatile axi_dma_out_crc_init_data_chn_reg_t out_crc_init_data_ch1;
    volatile axi_dma_tx_crc_width_chn_reg_t tx_crc_width_ch1;
    volatile axi_dma_out_crc_clear_chn_reg_t out_crc_clear_ch1;
    volatile axi_dma_out_crc_final_result_chn_reg_t out_crc_final_result_ch1;
    volatile axi_dma_tx_crc_en_wr_data_chn_reg_t tx_crc_en_wr_data_ch1;
    volatile axi_dma_tx_crc_en_addr_chn_reg_t tx_crc_en_addr_ch1;
    volatile axi_dma_tx_crc_data_en_wr_data_chn_reg_t tx_crc_data_en_wr_data_ch1;
    volatile axi_dma_tx_crc_data_en_addr_chn_reg_t tx_crc_data_en_addr_ch1;
    volatile axi_dma_out_int_raw_chn_reg_t out_int_raw_ch2;
    volatile axi_dma_out_int_st_chn_reg_t out_int_st_ch2;
    volatile axi_dma_out_int_ena_chn_reg_t out_int_ena_ch2;
    volatile axi_dma_out_int_clr_chn_reg_t out_int_clr_ch2;
    volatile axi_dma_out_conf0_ch2_reg_t out_conf0_ch2;
    volatile axi_dma_out_conf1_chn_reg_t out_conf1_ch2;
    volatile axi_dma_outfifo_status_chn_reg_t outfifo_status_ch2;
    volatile axi_dma_out_push_chn_reg_t out_push_ch2;
    volatile axi_dma_out_link1_chn_reg_t out_link1_ch2;
    volatile axi_dma_out_link2_chn_reg_t out_link2_ch2;
    volatile axi_dma_out_state_chn_reg_t out_state_ch2;
    volatile axi_dma_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch2;
    volatile axi_dma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr_ch2;
    volatile axi_dma_out_dscr_chn_reg_t out_dscr_ch2;
    volatile axi_dma_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch2;
    volatile axi_dma_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch2;
    volatile axi_dma_out_pri_chn_reg_t out_pri_ch2;
    volatile axi_dma_out_peri_sel_chn_reg_t out_peri_sel_ch2;
    volatile axi_dma_out_crc_init_data_chn_reg_t out_crc_init_data_ch2;
    volatile axi_dma_tx_crc_width_chn_reg_t tx_crc_width_ch2;
    volatile axi_dma_out_crc_clear_chn_reg_t out_crc_clear_ch2;
    volatile axi_dma_out_crc_final_result_chn_reg_t out_crc_final_result_ch2;
    volatile axi_dma_tx_crc_en_wr_data_chn_reg_t tx_crc_en_wr_data_ch2;
    volatile axi_dma_tx_crc_en_addr_chn_reg_t tx_crc_en_addr_ch2;
    volatile axi_dma_tx_crc_data_en_wr_data_chn_reg_t tx_crc_data_en_wr_data_ch2;
    volatile axi_dma_tx_crc_data_en_addr_chn_reg_t tx_crc_data_en_addr_ch2;
    volatile axi_dma_arb_timeout_reg_t arb_timeout;
    volatile axi_dma_weight_en_reg_t weight_en;
    volatile axi_dma_in_mem_conf_reg_t in_mem_conf;
    volatile axi_dma_intr_mem_start_addr_reg_t intr_mem_start_addr;
    volatile axi_dma_intr_mem_end_addr_reg_t intr_mem_end_addr;
    volatile axi_dma_extr_mem_start_addr_reg_t extr_mem_start_addr;
    volatile axi_dma_extr_mem_end_addr_reg_t extr_mem_end_addr;
    volatile axi_dma_in_reset_avail_chn_reg_t in_reset_avail_chn[3];
    volatile axi_dma_out_reset_avail_chn_reg_t out_reset_avail_chn[3];
    uint32_t reserved_2a4;
    volatile axi_dma_misc_conf_reg_t misc_conf;
    volatile axi_dma_rdn_result_reg_t rdn_result;
    volatile axi_dma_rdn_eco_high_reg_t rdn_eco_high;
    volatile axi_dma_rdn_eco_low_reg_t rdn_eco_low;
    volatile axi_dma_wresp_cnt_reg_t wresp_cnt;
    volatile axi_dma_rresp_cnt_reg_t rresp_cnt;
    volatile axi_dma_infifo_status1_chn_reg_t infifo_status1_chn[3];
    volatile axi_dma_outfifo_status1_chn_reg_t outfifo_status1_chn[3];
    volatile axi_dma_date_reg_t date;
    volatile axi_dma_link_switch_state_reg_t link_switch_state;
} axi_dma_dev_t;

extern axi_dma_dev_t AXI_DMA;

#ifndef __cplusplus
_Static_assert(sizeof(axi_dma_dev_t) == 0x2e0, "Invalid size of axi_dma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
